blog/2014-10-22-tmp.org
#+TITLE: tmp
#+DATE: 2014-10-22
#+SETUPFILE: ~/sys/lib/org-sty/octopress.org
#+JEKYLL_LAYOUT: post
#+JEKYLL_CATEGORIES: 
#+JEKYLL_PUBLISHED: true
#+OPTIONS: toc:nil tex:t ::t \n:t

* HI
* 1
** 2
*** 3
**** 4
***** 5
****** 6
* table
-
| a | b | c |
|---+---+---|
| 4 | 5 | 6 |
| 1 | 2 | 3 |

* Lord of the Rings
   My favorite scenes are (in this order)
   1. The attack of the Rohirrim
   2. Eowyn's fight with the witch king
      + this was already my favorite scene in the book
      + I really like Miranda Otto.
   3. Peter Jackson being shot by Legolas
      - on DVD only
      He makes a really funny face when it happens.
      But in the end, no individual scenes matter but the film as a whole.
   Important actors in this film are:
   - Elijah Wood :: He plays Frodo
   - Sean Austin :: He plays Sam, Frodo's friend.  I still remember
     him very well from his role as Mikey Walsh in The Goonies.

* Tmp
+ A
  + ABT
  + TA
    + ABNAT
      - aobnta
      + AOBTNEBN
+ B
+ C
- d
- e
+ F
- g
+ 1
  + 2
    + 3
      - 4
        - 5
          - 6
            - 7
              - 8
                - 9
* TABLE [[http://orgmode.org/manual/Tables-in-HTML-export.html#Tables-in-HTML-export][table]]

a

|      a | bbbbbbbbbb | c | d                      | e |
|--------+------------+---+------------------------+---|
| 111111 |            |   |                        |   |
|      2 |            |   |                        |   |
|      3 |            |   | jjjjjjjjjjjjjjjjjjjjjj |   |
|      4 |            |   |                        |   |

#+CAPTION: This is a table with lines around and between cells
#+ATTR_HTML: :border 2 :rules all :frame border
|      a | bbbbbbbbbb | c | d                      | e |
|--------+------------+---+------------------------+---|
| 111111 |            |   |                        |   |
|      2 |            |   |                        |   |
|      3 |            |   | jjjjjjjjjjjjjjjjjjjjjj |   |
|      4 |            |   |                        |   |


* TEXT [[http://orgmode.org/manual/Text-areas-in-HTML-export.html#Text-areas-in-HTML-export][text]]
#+ATTR_HTML: :textarea t :width 40
#+BEGIN_EXAMPLE
  (defun org-xor (a b)
     "Exclusive or."
     (if a (not b) b))
#+END_EXAMPLE

* line break
0
#+BEGIN_HTML
#+END_HTML
1
#+BEGIN_HTML
<br>
#+END_HTML
2
#+BEGIN_HTML
<br>
<br>
#+END_HTML
3
#+BEGIN_HTML
<br>
<br>
<br>
#+END_HTML
4

00
11

22


33



44


* latex

\begin{equation}
\begin{align}
\mbox{Union: }  A\cup B = \{x\mid x\in A \mbox{ or } x\in B\} \newline
\mbox{Concatenation: } A\circ B  = \{xy\mid x\in A \mbox{ and } y\in B\} \\
\mbox{Star: } A^\star  = \{x_1x_2\ldots x_k \mid  k\geq 0 \mbox{ and each } x_i\in A\} \\
\end{align}
\end{equation}

* latex
[[http://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html#sec-6][aa]]

\begin{equation}
x=\sqrt{b}
\end{equation}

If $a^2=b$ and \( b=2 \), then the solution must be
either $$ a=+\sqrt{2} $$ or \[ a=-\sqrt{2} \].

#+BEGIN_LATEX
\begin{equation}
x=\sqrt{b}
\end{equation}
If $a^2=b$ and \( b=2 \), then the solution must be
either $$ a=+\sqrt{2} $$ or \[ a=-\sqrt{2} \].
#+END_LATEX

- 
The mass of the sun is M_sun = 1.989 x 10^30 kg. 
The radius of the sun is R_{sun} = 6.96 x 10^8 m.
- @@latex:\overleftarrow{hi}\\@@
- @@latex:\underbrace{bye}\\@@
- Hi

* latex_abc
\Sigma








\Psi

\Omega

* 한글
광야(이육사)

까마득한 날에
하늘이 처음 열리고
어데 닭 우는 소리 들렸으랴

모든 산맥들이
바다를 연모해 휘달릴 때도
차마 이곳을 범하던 못하였으리라

끊임없는 광음을
부즈런한 계절이 피어선지고
큰 강물이 비로소 길을 열었다

지금 눈 나리고
매화향기 홀로 아득하니
내 여기 가난한 노래의 씨를 뿌려라

다시 천고의 뒤에
백마 타고 오는 초인이 있어
이 광야에서 목놓아 부르게 하리라


