blog/2014/10/22/tmp/index.html

<!DOCTYPE html>
<!--[if IEMobile 7 ]><html class="no-js iem7"><![endif]-->
<!--[if lt IE 9]><html class="no-js lte-ie8"><![endif]-->
<!--[if (gt IE 8)|(gt IEMobile 7)|!(IEMobile)|!(IE)]><!--><html class="no-js" lang="en"><!--<![endif]-->
<head>
  <meta charset="utf-8">
  <title>Tmp - sven&#8217;s blog</title>
  <meta name="author" content="sven">

  
  <meta name="description" content="1 HI 2 1 2.1 2 2.1.1 3 456 3 table a
b
c 4
5
6 1
2
3 4 Lord of the Rings My favorite scenes are (in this order) The attack of the Rohirrim Eowyn's &hellip;">
  

  <!-- http://t.co/dKP3o1e -->
  <meta name="HandheldFriendly" content="True">
  <meta name="MobileOptimized" content="320">
  <meta name="viewport" content="width=device-width, initial-scale=1">

  
  <link rel="canonical" href="http://sven--.github.io/blog/2014/10/22/tmp">
  <link href="/favicon.png" rel="icon">
  <link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
  <link href="/stylesheets/data-table.css" media="screen, projection" rel="stylesheet" type="text/css" />
  <link href="/atom.xml" rel="alternate" title="sven's blog" type="application/atom+xml">
  <!--Fonts from Google"s Web font directory at http://google.com/webfonts -->
<link href="//fonts.googleapis.com/css?family=PT+Serif:regular,italic,bold,bolditalic" rel="stylesheet" type="text/css">
<link href="//fonts.googleapis.com/css?family=PT+Sans:regular,italic,bold,bolditalic" rel="stylesheet" type="text/css">

  

</head>


<body   >
  <header role="banner"><hgroup>
  <h1><a href="/">sven&#8217;s blog</a></h1>
  
</hgroup>

</header>
  <nav role="navigation"><ul class="subscription" data-subscription="rss">
  <li><a href="/atom.xml" rel="subscribe-rss" title="subscribe via RSS">RSS</a></li>
  
</ul>
  
<form action="https://www.google.com/search" method="get">
  <fieldset role="search">
    <input type="hidden" name="q" value="site:sven--.github.io" />
    <input class="search" type="text" name="q" results="0" placeholder="Search"/>
  </fieldset>
</form>
  
<ul class="main-navigation">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
</ul>

</nav>
  <div id="main">
    <div id="content">
      <div>
<article class="hentry" role="article">
  
  <header>
    
      <h1 class="entry-title">Tmp</h1>
    
    
      <p class="meta">
        




<time class='entry-date' datetime='2014-10-22'><span class='date'><span class='date-month'>Oct</span> <span class='date-day'>22</span><span class='date-suffix'>nd</span>, <span class='date-year'>2014</span></span> <span class='time'>12:00 am</span></time>
        
      </p>
    
  </header>


<div class="entry-content"><div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> HI</h2>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 1</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 2</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> 3</h4>
<div class="outline-text-4" id="text-2-1-1">
</div><ol class="org-ol"><li><a id="sec-2-1-1-1" name="sec-2-1-1-1"></a>4<br  /><ol class="org-ol"><li><a id="sec-2-1-1-1-1" name="sec-2-1-1-1-1"></a>5<br  /><ol class="org-ol"><li><a id="sec-2-1-1-1-1-1" name="sec-2-1-1-1-1-1"></a>6<br  /></li></ol>
</li></ol>
</li></ol>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> table</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li></li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">a</th>
<th scope="col" class="right">b</th>
<th scope="col" class="right">c</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">4</td>
<td class="right">5</td>
<td class="right">6</td>
</tr>

<tr>
<td class="right">1</td>
<td class="right">2</td>
<td class="right">3</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Lord of the Rings</h2>
<div class="outline-text-2" id="text-4">
<p>
My favorite scenes are (in this order)<br  />
</p>
<ol class="org-ol">
<li>The attack of the Rohirrim<br  />
</li>
<li>Eowyn&#8217;s fight with the witch king<br  />
<ul class="org-ul">
<li>this was already my favorite scene in the book<br  />
</li>
<li>I really like Miranda Otto.<br  />
</li>
</ul>
</li>
<li>Peter Jackson being shot by Legolas<br  />
<ul class="org-ul">
<li>on DVD only<br  />
</li>
</ul>
<p>
He makes a really funny face when it happens.<br  />
But in the end, no individual scenes matter but the film as a whole.<br  />
</p>
</li>
</ol>
<p>
Important actors in this film are:<br  />
</p>
<dl class="org-dl">
<dt> Elijah Wood </dt><dd>He plays Frodo<br  />
</dd>
<dt> Sean Austin </dt><dd>He plays Sam, Frodo&#8217;s friend.  I still remember<br  />
him very well from his role as Mikey Walsh in The Goonies.<br  />
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Tmp</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>A<br  />
<ul class="org-ul">
<li>ABT<br  />
</li>
<li>TA<br  />
<ul class="org-ul">
<li>ABNAT<br  />
<ul class="org-ul">
<li>aobnta<br  />
</li>
<li>AOBTNEBN<br  />
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li>B<br  />
</li>
<li>C<br  />
</li>
<li>d<br  />
</li>
<li>e<br  />
</li>
<li>F<br  />
</li>
<li>g<br  />
</li>
<li>1<br  />
<ul class="org-ul">
<li>2<br  />
<ul class="org-ul">
<li>3<br  />
<ul class="org-ul">
<li>4<br  />
<ul class="org-ul">
<li>5<br  />
<ul class="org-ul">
<li>6<br  />
<ul class="org-ul">
<li>7<br  />
<ul class="org-ul">
<li>8<br  />
<ul class="org-ul">
<li>9<br  />
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> TABLE <a href="http://orgmode.org/manual/Tables-in-HTML-export.html#Tables-in-HTML-export">table</a></h2>
<div class="outline-text-2" id="text-6">
<p>
a<br  />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">a</th>
<th scope="col" class="left">bbbbbbbbbb</th>
<th scope="col" class="left">c</th>
<th scope="col" class="left">d</th>
<th scope="col" class="left">e</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">111111</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">2</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">3</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">jjjjjjjjjjjjjjjjjjjjjj</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">4</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<caption class="t-above"><span class="table-number">Table 1:</span> This is a table with lines around and between cells</caption>

<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">a</th>
<th scope="col" class="left">bbbbbbbbbb</th>
<th scope="col" class="left">c</th>
<th scope="col" class="left">d</th>
<th scope="col" class="left">e</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">111111</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">2</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">3</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">jjjjjjjjjjjjjjjjjjjjjj</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">4</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> TEXT <a href="http://orgmode.org/manual/Text-areas-in-HTML-export.html#Text-areas-in-HTML-export">text</a></h2>
<div class="outline-text-2" id="text-7">
<p>
<textarea cols="40" rows="3">
(defun org-xor (a b)
   &#8220;Exclusive or.&#8221;
   (if a (not b) b))
</textarea>
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> line break</h2>
<div class="outline-text-2" id="text-8">
<p>
0<br  />
</p>
<p>
1<br  />
</p>
<br>
<p>
2<br  />
</p>
<br>
<br>
<p>
3<br  />
</p>
<br>
<br>
<br>
<p>
4<br  />
</p>

<p>
00<br  />
11<br  />
</p>

<p>
22<br  />
</p>


<p>
33<br  />
</p>



<p>
44<br  />
</p>
</div>
</div>


<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> latex</h2>
<div class="outline-text-2" id="text-9">
\begin{equation}
\begin{align}
\mbox{Union: }  A\cup B = \{x\mid x\in A \mbox{ or } x\in B\} \newline
\mbox{Concatenation: } A\circ B  = \{xy\mid x\in A \mbox{ and } y\in B\} &#92;
\mbox{Star: } A^\star  = \{x_1x_2\ldots x_k \mid  k\geq 0 \mbox{ and each } x_i\in A\} &#92;
\end{align}
\end{equation}
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> latex</h2>
<div class="outline-text-2" id="text-10">
<p>
<a href="http://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html#sec-6">aa</a><br  />
</p>

\begin{equation}
x=\sqrt{b}
\end{equation}

<p>
If \(a^2=b\) and \( b=2 \), then the solution must be<br  />
either $$ a=+\sqrt{2} $$ or \[ a=-\sqrt{2} \].<br  />
</p>

<ul class="org-ul">
<li></li>
</ul>
<p>
The mass of the sun is M<sub>sun</sub> = 1.989 x 10<sup>30</sup> kg.<br  />
The radius of the sun is R<sub>sun</sub> = 6.96 x 10<sup>8</sup> m.<br  />
</p>
<ul class="org-ul">
<li><br  />
</li>
<li><br  />
</li>
<li>Hi<br  />
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> latex<sub>abc</sub></h2>
<div class="outline-text-2" id="text-11">
<p>
&Sigma;<br  />
</p>








<p>
&Psi;<br  />
</p>

<p>
&Omega;<br  />
</p>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> 한글</h2>
<div class="outline-text-2" id="text-12">
<p>
광야(이육사)<br  />
</p>

<p>
까마득한 날에<br  />
하늘이 처음 열리고<br  />
어데 닭 우는 소리 들렸으랴<br  />
</p>

<p>
모든 산맥들이<br  />
바다를 연모해 휘달릴 때도<br  />
차마 이곳을 범하던 못하였으리라<br  />
</p>

<p>
끊임없는 광음을<br  />
부즈런한 계절이 피어선지고<br  />
큰 강물이 비로소 길을 열었다<br  />
</p>

<p>
지금 눈 나리고<br  />
매화향기 홀로 아득하니<br  />
내 여기 가난한 노래의 씨를 뿌려라<br  />
</p>

<p>
다시 천고의 뒤에<br  />
백마 타고 오는 초인이 있어<br  />
이 광야에서 목놓아 부르게 하리라<br  />
</p>
</div>
</div>
