blog/2014/10/22/tmp/index.html


<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> <a href="http://blog.paphus.com/blog/2012/08/01/introducing-octopress-blogging-for-org-mode/">example</a></h2>
<div class="outline-text-2" id="text-13">
<p>
On an <a href="http://blog.paphus.com/blog/2012/07/21/octopress-and-org-mode/">earlier post</a> I described a method for exporting <a href="http://www.gnu.org/software/emacs/">Emacs</a> <a href="http://orgmode.org/">Org-Mode</a> to Octopress. The main feature that simply exporting to HTML lacked was syntax highlighting. The method from my old post sadly was unreliable so I went back to the drawing boards and now I have a far better solution.<br  />
</p>

<p>
First you will need to set up <a href="http://octopress.org/">Octopress</a> Following their instructions. I find that after cloning their repository and entering it I have to run these commands:<br  />
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #465a61; font-style: italic;">#</span><span style="color: #465a61; font-style: italic;">!/bin/</span><span style="color: #728a05;">sh</span>
<span style="color: #465a61; font-style: italic;">#</span>
curl -L https://get.rvm.io | bash -s stable --ruby
<span style="color: #728a05;">source</span> ~/.rvm/scripts/rvm
rvm install 1.9.2
rvm rubygems latest
gem install bundler
bundle install
rake install
</pre>
</div>

<p>
Like last time, we need a <code>save-then-publish</code> function in our <code>.emacs</code><br  />
</p>
<div class="org-src-container">

<pre class="src src-scheme">(defun save-then-publish ()
  (interactive)
  (save-buffer)
  (org-save-all-org-buffers)
  (org-publish-current-project))
</pre>
</div>

<p>
And we also need to set up our projects. I personally store my octopress blog in <code>~/git/blog/</code> but if you store your blog elsewhere you will need to change paths.<br  />
</p>
<div class="org-src-container">

<pre class="src src-scheme">(setq org-publish-project-alist
      '((<span style="color: #259185;">"blog-org"</span> .  (<span style="color: #728a05;">:base-directory</span> <span style="color: #259185;">"~/git/blog/source/org_posts/"</span>
                                        <span style="color: #728a05;">:base-extension</span> <span style="color: #259185;">"org"</span>
                                        <span style="color: #728a05;">:publishing-directory</span> <span style="color: #259185;">"~/git/blog/source/_posts/"</span>
                                        <span style="color: #728a05;">:sub-superscript</span> <span style="color: #259185;">""</span>
                                        <span style="color: #728a05;">:recursive</span> t
                                        <span style="color: #728a05;">:publishing-function</span> org-publish-org-to-octopress
                                        <span style="color: #728a05;">:headline-levels</span> 4
                                        <span style="color: #728a05;">:html-extension</span> <span style="color: #259185;">"markdown"</span>
                                        <span style="color: #728a05;">:octopress-extension</span> <span style="color: #259185;">"markdown"</span>
                                        <span style="color: #728a05;">:body-only</span> t))
        (<span style="color: #259185;">"blog-extra"</span> . (<span style="color: #728a05;">:base-directory</span> <span style="color: #259185;">"~/git/blog/source/org_posts/"</span>
                                         <span style="color: #728a05;">:publishing-directory</span> <span style="color: #259185;">"~/git/blog/source/"</span>
                                         <span style="color: #728a05;">:base-extension</span> <span style="color: #259185;">"css\\|pdf\\|png\\|jpg\\|gif\\|svg"</span>
                                         <span style="color: #728a05;">:publishing-function</span> org-publish-attachment
                                         <span style="color: #728a05;">:recursive</span> t
                                         <span style="color: #728a05;">:author</span> nil
                                         ))
        (<span style="color: #259185;">"blog"</span> . (<span style="color: #728a05;">:components</span> (<span style="color: #259185;">"blog-org"</span> <span style="color: #259185;">"blog-extra"</span>)))
        ))
</pre>
</div>

<p>
Now we need to edit the <code>Rakefile</code> in the blog. Find your Misc Configs section and change <code>new_post_ext</code>, <code>new_page_ext</code>, and add <code>org_posts_dir</code> like I have below:<br  />
</p>
<div class="org-src-container">

<pre class="src src-text">## -- Misc Configs -- ##

public_dir      = "public"    # compiled site directory
source_dir      = "source"    # source file directory
blog_index_dir  = 'source'    # directory for your blog's index page (if you put your index in source/blog/index.html, set this to 'source/blog')
deploy_dir      = "_deploy"   # deploy directory (for Github pages deployment)
stash_dir       = "_stash"    # directory to stash posts for speedy generation
posts_dir       = "_posts"    # directory for blog files
org_posts_dir   = "org_posts"
themes_dir      = ".themes"   # directory for blog files
new_post_ext    = "org"  # default new post file extension when using the new_post task
new_page_ext    = "org"  # default new page file extension when using the new_page task
server_port     = "4000"      # port for preview server eg. localhost:4000
</pre>
</div>

<p>
We also need to edit the <code>Rakefile</code> so that the header of a new post gets wrapped in HTML tags. Find the section I have below and add the lines for <code>BEGIN_HTML</code> and <code>END_HTML</code>.<br  />
</p>
<div class="org-src-container">

<pre class="src src-text">post.puts "#+BEGIN_HTML"
post.puts "---"
post.puts "layout: post"
post.puts "title: \"#{title.gsub(/&amp;/,'&amp;amp;')}\""
post.puts "date: #{Time.now.strftime('%Y-%m-%d %H:%M')}"
post.puts "comments: true"
post.puts "categories: "
post.puts "---"
post.puts "#+END_HTML"
</pre>
</div>

<p>
Now we need to grab the new Octopress exporter I made by making modifications to the built in HTML exporter. The new exporter is located on github at <a href="https://github.com/craftkiller/orgmode-octopress">https://github.com/craftkiller/orgmode-octopress</a>. So download <a href="https://raw.github.com/craftkiller/orgmode-octopress/master/org-octopress.el">org-octopress.el</a> and place it somewhere in your emacs load-path and add <code>(require 'org-octopress)</code>. I cloned the repository in ~/git/ so in my emacs I added<br  />
</p>
<div class="org-src-container">

<pre class="src src-scheme">(add-to-list 'load-path <span style="color: #259185;">"~/git/orgmode-octopress"</span>)
(require 'org-octopress)
</pre>
</div>

<p>
Now you should be ready to blog! To create a new post you must first create it and then move it to the org\<sub>posts</sub> directory like so:<br  />
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #728a05;">cd</span> blog
rake <span style="color: #259185;">"new_post[title]"</span>
mv source/_posts/2012-08-01-title.org source/org_posts/
<span style="color: #465a61; font-style: italic;"># </span><span style="color: #465a61; font-style: italic;">I keep my posts in GIT so then I add it to the repo</span>
git add source/org_posts/2012-08-01-title.org
</pre>
</div>

<p>
After writing the post simply do <code>M-x save-then-publish</code> in Emacs and then go back to your shell and run <code>rake gen_deploy</code>. You should now have your post online.<br  />
</p>

<p>
The main feature that I added was the ability to have syntax highlighted blocks. Right now this will only work with all lower-case <code>begin_src</code> <code>end_src</code> blocks. It supports options for <code>:title</code> <code>:url</code> and <code>:urltext</code>. If you would like to see an example of this, the source code to this post is located at <a href="http://blog.paphus.com/org_posts/2012-08-01-introducing-octopress-blogging-for-org-mode.org"><a href="http://blog.paphus.com/org\_posts/2012-08-01-introducing-octopress-blogging-for-org-mode.org">http://blog.paphus.com/org\_posts/2012-08-01-introducing-octopress-blogging-for-org-mode.org</a></a>. If anyone wants to help improve the exporter please join me on github!<br  />
</p>

<p>
Finally, You may want to edit your .htaccess file to redirect image requests. I redirected all SVG image requests to the root directory so perma-links dont fail to access the images. You want to locate the <code>.htaccess</code> file in the <code>source</code> directory<br  />
</p>
<div class="org-src-container">

<pre class="src src-text">Options +FollowSymlinks
RewriteEngine on
RewriteBase /
RewriteRule /([^/]+)\.(svg)$ /$1.$2 [R,L]
</pre>
</div>

<p>
<br  />
</p>
</div>
</div>
</div>


  <footer>
    <p class="meta">
      
  

<span class="byline author vcard">Posted by <span class="fn">sven</span></span>

      




<time class='entry-date' datetime='2014-10-22'><span class='date'><span class='date-month'>Oct</span> <span class='date-day'>22</span><span class='date-suffix'>nd</span>, <span class='date-year'>2014</span></span> <span class='time'>12:00 am</span></time>
      


    </p>
    
      <div class="sharing">
  
  <a href="//twitter.com/share" class="twitter-share-button" data-url="http://sven--.github.io/blog/2014/10/22/tmp/" data-via="" data-counturl="http://sven--.github.io/blog/2014/10/22/tmp/" >Tweet</a>
  
  
  
</div>

    
    <p class="meta">
      
      
        <a class="basic-alignment right" href="/blog/2014/10/22/md-ex/" title="Next Post: md_ex">md_ex &raquo;</a>
      
    </p>
  </footer>
</article>

</div>

<aside class="sidebar">
  
    <section>
  <h1>Recent Posts</h1>
  <ul id="recent_posts">
    
      <li class="post">
        <a href="/blog/2014/10/23/prepare/">Prepare</a>
      </li>
    
      <li class="post">
        <a href="/blog/2014/10/22/md-ex/">Md_ex</a>
      </li>
    
      <li class="post">
        <a href="/blog/2014/10/22/tmp/">Tmp</a>
      </li>
    
  </ul>
</section>





  
</aside>


    </div>
  </div>
  <footer role="contentinfo"><p>
  Copyright &copy; 2014 - sven -
  <span class="credit">Powered by <a href="http://octopress.org">Octopress</a></span>
</p>

</footer>
  







  <script type="text/javascript">
    (function(){
      var twitterWidgets = document.createElement('script');
      twitterWidgets.type = 'text/javascript';
      twitterWidgets.async = true;
      twitterWidgets.src = '//platform.twitter.com/widgets.js';
      document.getElementsByTagName('head')[0].appendChild(twitterWidgets);
    })();
  </script>





</body>
</html>
